In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

In [3]:
%%sql
Drop table if exists events;

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [4]:
%%sql
CREATE TABLE events (
    event_id INT AUTO_INCREMENT PRIMARY KEY,
    event_name VARCHAR(100),
    event_date DATETIME,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [5]:
%%sql
INSERT INTO events (event_name, event_date)
VALUES
('Team Meeting',  '2025-01-15 10:30:00'),
('Conference',    '2025-02-10 09:00:00'),
('Online Webinar','2025-03-05 15:45:00'),
('Workshop',      '2025-03-20 13:30:00');

 * mysql+mysqlconnector://root:***@localhost/mydb
4 rows affected.

[]

In [6]:
%%sql
select * from events

 * mysql+mysqlconnector://root:***@localhost/mydb
4 rows affected.

[(1, 'Team Meeting', datetime.datetime(2025, 1, 15, 10, 30), datetime.datetime(2025, 12, 11, 15, 20, 40)),
 (2, 'Conference', datetime.datetime(2025, 2, 10, 9, 0), datetime.datetime(2025, 12, 11, 15, 20, 40)),
 (3, 'Online Webinar', datetime.datetime(2025, 3, 5, 15, 45), datetime.datetime(2025, 12, 11, 15, 20, 40)),
 (4, 'Workshop', datetime.datetime(2025, 3, 20, 13, 30), datetime.datetime(2025, 12, 11, 15, 20, 40))]

In [8]:
%%sql
# Date and time 
# Extracting the year from the event column 
select event_id, event_name, YEAR(event_date) as Year_event, Date(event_date) as date_event, day(event_date) as day_event from events 
# the YEAR, date, dayfunction does this

 * mysql+mysqlconnector://root:***@localhost/mydb
4 rows affected.

[(1, 'Team Meeting', 2025, datetime.date(2025, 1, 15), 15),
 (2, 'Conference', 2025, datetime.date(2025, 2, 10), 10),
 (3, 'Online Webinar', 2025, datetime.date(2025, 3, 5), 5),
 (4, 'Workshop', 2025, datetime.date(2025, 3, 20), 20)]

In [12]:
%%sql
select event_id, event_name,event_date, event_date + INTERVAL 30 day as Added_30_days from events
# Adds the 30 or n days you want to add in the actual date

 * mysql+mysqlconnector://root:***@localhost/mydb
4 rows affected.

[(1, 'Team Meeting', datetime.datetime(2025, 1, 15, 10, 30), datetime.datetime(2025, 2, 14, 10, 30)),
 (2, 'Conference', datetime.datetime(2025, 2, 10, 9, 0), datetime.datetime(2025, 3, 12, 9, 0)),
 (3, 'Online Webinar', datetime.datetime(2025, 3, 5, 15, 45), datetime.datetime(2025, 4, 4, 15, 45)),
 (4, 'Workshop', datetime.datetime(2025, 3, 20, 13, 30), datetime.datetime(2025, 4, 19, 13, 30))]

In [11]:
%%sql
select event_id, event_name,event_date, event_date - INTERVAL 30 day as Sub_30_days from events 
# Minus 30 days from the actual date

 * mysql+mysqlconnector://root:***@localhost/mydb
4 rows affected.

[(1, 'Team Meeting', datetime.datetime(2025, 1, 15, 10, 30), datetime.datetime(2024, 12, 16, 10, 30)),
 (2, 'Conference', datetime.datetime(2025, 2, 10, 9, 0), datetime.datetime(2025, 1, 11, 9, 0)),
 (3, 'Online Webinar', datetime.datetime(2025, 3, 5, 15, 45), datetime.datetime(2025, 2, 3, 15, 45)),
 (4, 'Workshop', datetime.datetime(2025, 3, 20, 13, 30), datetime.datetime(2025, 2, 18, 13, 30))]

In [23]:
%%sql
select event_id, event_name, Date_format(event_date,'%W, %M %e %Y') as formatted_dates from events;

 * mysql+mysqlconnector://root:***@localhost/mydb
4 rows affected.

[(1, 'Team Meeting', 'Wednesday, January 15 2025'),
 (2, 'Conference', 'Monday, February 10 2025'),
 (3, 'Online Webinar', 'Wednesday, March 5 2025'),
 (4, 'Workshop', 'Thursday, March 20 2025')]

In [34]:
%%sql
select event_id, event_name, Date_format(event_date,'%h %i %p') as formatted_dates from events;

 * mysql+mysqlconnector://root:***@localhost/mydb
4 rows affected.

[(1, 'Team Meeting', '10 30 AM'),
 (2, 'Conference', '09 00 AM'),
 (3, 'Online Webinar', '03 45 PM'),
 (4, 'Workshop', '01 30 PM')]